app/views/tracks/new.html.erb

SELECT "bands".* FROM "bands" WHERE "bands"."user_id" = ?  [["user_id", 3]]
SELECT "albums".* FROM "albums" WHERE "albums"."user_id" = ?  [["user_id", 3]]
---
        <%= render "shared/errors", :flash => flash%>
          Artist: <%= f.collection_select :band_id, Band.where(:user_id => current_user.id).all, :id, :name, :prompt => "Select a Band" , class: 'form-control'%>
          Album: <%= f.collection_select :album_id, Album.where(:user_id => current_user.id).all, :id, :name, :prompt => "Select a Album", class: 'form-control' %>