app/views/albums/new.html.erb

              <option value=''></option>
              <% Band.where(:user_id => current_user.id).each do |band| %>
---
SELECT "bands".* FROM "bands" WHERE "bands"."user_id" = ?  [["user_id", 3]]