app/views/albums/show.html.erb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = ?  [["album_id", 6]]
---
        <div class="track ">
          <% @album.tracks.each do |track|%>