app/views/bands/_all_bands.html.erb

SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = ?  [["band_id", "1"]]
SELECT COUNT(*) FROM "albums" WHERE "albums"."band_id" = ?  [["band_id", "1"]]
---
          <h3 class=''><%= band.name%></h3>
          <p> <%= pluralize(band.albums.count,'album')%></p>