app/controllers/albums_controller.rb

SELECT "albums".* FROM "albums" WHERE "albums"."user_id" = ? AND "albums"."favotite" = ?  [["user_id", 3], ["favotite", "t"]]
---
  def index

    if params[:favorite]
      @albums_favorite = Album.where(:user_id => current_user.id, :favotite => true).all

SELECT "bands".* FROM "bands" WHERE "bands"."user_id" = ?  [["user_id", 3]]
---
  def new
    @album = Album.new
    @bands = Band.where(:user_id => current_user.id)

INSERT INTO "albums" ("name", "year", "band_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Rio1"], ["year", 2014], ["band_id", "1"], ["user_id", 2], ["created_at", "2015-11-09 18:05:49.731331"], ["updated_at", "2015-11-09 18:05:49.731331"]]
---
  def create
    @album = current_user.albums.new(album_params)
    if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."user_id" = ? AND "albums"."id" = ? LIMIT 1  [["user_id", 3], ["id", 20]]
DELETE FROM "albums" WHERE "albums"."id" = ?  [["id", 13]]
---
  def destroy
    @album = Album.where(:user_id => get_user_id).find(params[:id])
    @album.destroy

SELECT  "albums".* FROM "albums" WHERE "albums"."user_id" = ? AND "albums"."id" = ? LIMIT 1  [["user_id", 3], ["id", 9]]
UPDATE "albums" SET "favotite" = ?, "updated_at" = ? WHERE "albums"."id" = ?  [["favotite", "t"], ["updated_at", "2015-11-09 18:38:49.953746"], ["id", 2]]
---
  def favorite
    favor = Album.where(:user_id => current_user.id).find(params[:id])[:favotite]

    if favor
      Album.where(:user_id => current_user.id).update(params[:id], :favotite => false)