app/controllers/bands_controller.rb

SELECT "bands".* FROM "bands" WHERE "bands"."user_id" = ? AND "bands"."favotite" = ?  [["user_id", 3], ["favotite", "t"]]
---
  def index
    if params[:favorite]
      @bands_favorite = Band.where(:user_id => current_user.id, :favotite => true).all

INSERT INTO "bands" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Nina Simon"], ["user_id", 2], ["created_at", "2015-11-09 18:18:59.908830"], ["updated_at", "2015-11-09 18:18:59.908830"]]
---
  def create

    @band = current_user.bands.new(band_params)

    if @band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."user_id" = ? AND "bands"."id" = ? LIMIT 1  [["user_id", 3], ["id", 7]]
UPDATE "bands" SET "favotite" = ?, "updated_at" = ? WHERE "bands"."id" = ?  [["favotite", "t"], ["updated_at", "2015-11-09 20:35:51.397503"], ["id", 7]]
---
  def favorite

    favor = Band.where(:user_id => current_user.id).find(params[:id])[:favotite]

    if favor
      Band.where(:user_id => current_user.id).update(params[:id], :favotite => false)

SELECT  "bands".* FROM "bands" WHERE "bands"."user_id" = ? AND "bands"."id" = ? LIMIT 1  [["user_id", 3], ["id", 5]]
DELETE FROM "bands" WHERE "bands"."id" = ?  [["id", 5]]
---
  def destroy
    @band = Band.where(:user_id => get_user_id).find(params[:id])
    @band.destroy