app/controllers/search_controller.rb

SELECT  "albums".* FROM "albums" WHERE "albums"."user_id" = ? AND "albums"."band_id" = ? LIMIT 1  [["user_id", 4], ["band_id", "12"]]
---
  def index

    if (params[:search])
      band = Band.where(:user_id => current_user.id).search(params[:search])
      @bands = band.albums if band
      @album = Album.where(:user_id => current_user.id).search(params[:search])