app/controllers/tracks_controller.rb

  def index
    if params[:favorite]
      @tracks_favorite = Track.where(:user_id => current_user.id, :favotite => true).all
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."user_id" = ? AND "tracks"."favotite" = ?  [["user_id", 3], ["favotite", "t"]]

  def create
  #  track = Track.new(track_params)
    @track = current_user.tracks.new(track_params)
    if @track.save
---
INSERT INTO "tracks" ("name", "album_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "song1"], ["album_id", 9], ["user_id", 3], ["created_at", "2015-11-09 20:02:17.816332"], ["updated_at", "2015-11-09 20:02:17.816332"]]

  def favorite

    favor = Track.where(:user_id => current_user.id).find(params[:id])[:favotite]
    if favor
      Track.where(:user_id => current_user.id).update(params[:id], :favotite => false)
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."user_id" = ? AND "tracks"."id" = ? LIMIT 1  [["user_id", 3], ["id", 20]]
UPDATE "tracks" SET "favotite" = ?, "updated_at" = ? WHERE "tracks"."id" = ?  [["favotite", "t"], ["updated_at", "2015-11-09 18:37:40.653037"], ["id", 11]]

  def destroy
    @track = Track.where(:user_id => get_user_id).find(params[:id])
    @track.destroy
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."user_id" = ? AND "tracks"."id" = ? LIMIT 1  [["user_id", 3], ["id", 20]]
DELETE FROM "tracks" WHERE "tracks"."id" = ?  [["id", 30]]