app/controllers/users_controller.rb

INSERT INTO "users" ("password_digest", "username", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
   def create
     @user = User.new(user_params)

     if @user.save